    CREATE TABLE s_code_item_29db2ae1_00d4_41a0_aaff_70c001444d40 AS (   SELECT *   FROM s_code_item   ) ;
    TRUNCATE table s_code_item;

    INSERT INTO s_code_item
        (  `code_type`, `code_type_name`, `code_type_seq`, `code_item`, `code_item_key`, `code_item_name`, `code_item_seq`, `code_effect_start_date`,       `code_effect_end_date`,      `code_desc`)
    VALUES
        ( 'ACTION_TYPE',       '操作类型',         0,               '10',          'CREATE',           '创建',             10,              '2018-01-01 00:00:00',             '2999-12-31 00:00:00',                  '') ,
        ( 'ACTION_TYPE',       '操作类型',         0,               '20',          'UPDATE',           '编辑',             20,              '2018-01-01 00:00:00',             '2999-12-31 00:00:00',                  '') ,
        ( 'ACTION_TYPE',       '操作类型',         0,               '30',          'REMOVE',           '删除',             30,              '2018-01-01 00:00:00',             '2999-12-31 00:00:00',                  '') ,
        ( 'ACTION_TYPE',       '操作类型',         0,               '40',          'QUERY',           '查询',             40,              '2018-01-01 00:00:00',             '2999-12-31 00:00:00',                  '') ,
        ( 'ACTION_TYPE',       '操作类型',         0,               '50',          'PRINT',           '打印',             50,              '2018-01-01 00:00:00',             '2999-12-31 00:00:00',                  '') ,
        ( 'ACTION_TYPE',       '操作类型',         0,               '60',          'EXPORT',           '导出',             60,              '2018-01-01 00:00:00',             '2999-12-31 00:00:00',                  '') ,
        ( 'ACTION_TYPE',       '操作类型',         0,               '70',          'AUDIT',           '审核',             70,              '2018-01-01 00:00:00',             '2999-12-31 00:00:00',                  '') ,
        ( 'YES_NO',       '是否',         1,               '1',          'YES',           '是',             1,              '2018-01-01 00:00:00',             '2999-12-31 00:00:00',                  '') ,
        ( 'YES_NO',       '是否',         1,               '0',          'NO',           '否',             0,              '2018-01-01 00:00:00',             '2999-12-31 00:00:00',                  '') ,
        ( 'GENDER',       '性别',         2,               '1',          'MALE',           '男',             1,              '2018-01-01 00:00:00',             '2999-12-31 00:00:00',                  '') ,
        ( 'GENDER',       '性别',         2,               '2',          'FAMALE',           '女',             2,              '2018-01-01 00:00:00',             '2999-12-31 00:00:00',                  '') 
;