    CREATE TABLE s_code_item_9cd3a519_a6f3_4bd1_94d9_045530eed375 AS (   SELECT *   FROM s_code_item   ) ;
    TRUNCATE table s_code_item;

    INSERT INTO s_code_item
        (  `code_type`, `code_type_name`, `code_type_seq`, `code_item`, `code_item_key`, `code_item_name`, `code_item_seq`, `code_effect_start_date`,       `code_effect_end_date`,      `code_desc`)
    VALUES
        ( 'CUSTOMER_TYPE',       '客户类型',         0,               '100',          'C',           '铅顾客',             100,              '2018-01-01 00:00:00',             '2999-12-31 00:00:00',                  '') ,
        ( 'CUSTOMER_TYPE',       '客户类型',         0,               '200',          'B',           '铁顾客',             200,              '2018-01-01 00:00:00',             '2999-12-31 00:00:00',                  '') ,
        ( 'CUSTOMER_TYPE',       '客户类型',         0,               '400',          'A',           '黄金顾客',             400,              '2018-01-01 00:00:00',             '2999-12-31 00:00:00',                  '') ,
        ( 'CUSTOMER_TYPE',       '客户类型',         0,               '800',          'S',           '白金顾客',             800,              '2018-01-01 00:00:00',             '2999-12-31 00:00:00',                  '') ,
        ( 'ABANDON',       '状态',         1,               '0',          'AVAILABLE',           '正常',             0,              '2018-01-01 00:00:00',             '2999-12-31 00:00:00',                  '') ,
        ( 'ABANDON',       '状态',         1,               '1',          'REMOVE',           '删除',             1,              '2018-01-01 00:00:00',             '2999-12-31 00:00:00',                  '') ,
        ( 'ABANDON',       '状态',         1,               '2',          'OTHER',           '其他',             2,              '2018-01-01 00:00:00',             '2999-12-31 00:00:00',                  '') ,
        ( 'ABANDON',       '状态',         1,               '100',          'DISABLED ',           '禁用',             100,              '2018-01-01 00:00:00',             '2999-12-31 00:00:00',                  '') ,
        ( 'ATTACHMENT_CATEGORY',       '附件分类',         2,               '0',          'attachment_avatar',           '头像',             0,              '2018-01-01 00:00:00',             '2999-12-31 00:00:00',                  '') ,
        ( 'ATTACHMENT_CATEGORY',       '附件分类',         2,               '10',          'attachment_document',           '文档系统',             10,              '2018-01-01 00:00:00',             '2999-12-31 00:00:00',                  '') ,
        ( 'ATTACHMENT_CATEGORY',       '附件分类',         2,               '20',          'attachment_attachment',           '附件',             30,              '2018-01-01 00:00:00',             '2999-12-31 00:00:00',                  '') ,
        ( 'ATTACHMENT_CATEGORY',       '附件分类',         2,               '30',          'attachment_template',           '模板',             30,              '2018-01-01 00:00:00',             '2999-12-31 00:00:00',                  '') ,
        ( 'ATTACHMENT_CATEGORY',       '附件分类',         2,               '999',          'attachment_other',           '其他',             999,              '2018-01-01 00:00:00',             '2999-12-31 00:00:00',                  '') ,
        ( 'FORM_STATUS_TYPE',       '状态',         3,               '0',          'CREATED',           '待提交',             0,              '2018-01-01 00:00:00',             '2999-12-31 00:00:00',                  '') ,
        ( 'FORM_STATUS_TYPE',       '状态',         3,               '10',          'APPROVALING',           '审批中',             10,              '2018-01-01 00:00:00',             '2999-12-31 00:00:00',                  '') ,
        ( 'FORM_STATUS_TYPE',       '状态',         3,               '20',          'DISMISSED',           '被驳回',             20,              '2018-01-01 00:00:00',             '2999-12-31 00:00:00',                  '') ,
        ( 'FORM_STATUS_TYPE',       '状态',         3,               '30',          'COMPLETED',           '已完成',             30,              '2018-01-01 00:00:00',             '2999-12-31 00:00:00',                  '') ,
        ( 'FORM_STATUS_TYPE',       '状态',         3,               '999',          'REVOKE ',           '撤销',             999,              '2018-01-01 00:00:00',             '2999-12-31 00:00:00',                  '') 
;